GopalSaraf/Practicals/PSDL/include/proc/pic18f57q84.inc
// Register: C1TXQSTAL
#define C1TXQSTAL C1TXQSTAL
C1TXQSTAL                                equ 0154h
// bitfield definitions
C1TXQSTAL_TXQNIF_POSN                    equ 0000h
C1TXQSTAL_TXQNIF_POSITION                equ 0000h
C1TXQSTAL_TXQNIF_SIZE                    equ 0001h
C1TXQSTAL_TXQNIF_LENGTH                  equ 0001h
C1TXQSTAL_TXQNIF_MASK                    equ 0001h
C1TXQSTAL_TXQEIF_POSN                    equ 0002h
C1TXQSTAL_TXQEIF_POSITION                equ 0002h
C1TXQSTAL_TXQEIF_SIZE                    equ 0001h
C1TXQSTAL_TXQEIF_LENGTH                  equ 0001h
C1TXQSTAL_TXQEIF_MASK                    equ 0004h
C1TXQSTAL_TXATIF_POSN                    equ 0004h
C1TXQSTAL_TXATIF_POSITION                equ 0004h
C1TXQSTAL_TXATIF_SIZE                    equ 0001h
C1TXQSTAL_TXATIF_LENGTH                  equ 0001h
C1TXQSTAL_TXATIF_MASK                    equ 0010h
C1TXQSTAL_TXERR_POSN                     equ 0005h
C1TXQSTAL_TXERR_POSITION                 equ 0005h
C1TXQSTAL_TXERR_SIZE                     equ 0001h
C1TXQSTAL_TXERR_LENGTH                   equ 0001h
C1TXQSTAL_TXERR_MASK                     equ 0020h
C1TXQSTAL_TXLARB_POSN                    equ 0006h
C1TXQSTAL_TXLARB_POSITION                equ 0006h
C1TXQSTAL_TXLARB_SIZE                    equ 0001h
C1TXQSTAL_TXLARB_LENGTH                  equ 0001h
C1TXQSTAL_TXLARB_MASK                    equ 0040h
C1TXQSTAL_TXABT_POSN                     equ 0007h
C1TXQSTAL_TXABT_POSITION                 equ 0007h
C1TXQSTAL_TXABT_SIZE                     equ 0001h
C1TXQSTAL_TXABT_LENGTH                   equ 0001h
C1TXQSTAL_TXABT_MASK                     equ 0080h

// Register: C1TXQSTAH
#define C1TXQSTAH C1TXQSTAH
C1TXQSTAH                                equ 0155h
// bitfield definitions
C1TXQSTAH_TXQCI_POSN                     equ 0000h
C1TXQSTAH_TXQCI_POSITION                 equ 0000h
C1TXQSTAH_TXQCI_SIZE                     equ 0005h
C1TXQSTAH_TXQCI_LENGTH                   equ 0005h
C1TXQSTAH_TXQCI_MASK                     equ 001Fh
C1TXQSTAH_TXQCI0_POSN                    equ 0000h
C1TXQSTAH_TXQCI0_POSITION                equ 0000h
C1TXQSTAH_TXQCI0_SIZE                    equ 0001h
C1TXQSTAH_TXQCI0_LENGTH                  equ 0001h
C1TXQSTAH_TXQCI0_MASK                    equ 0001h
C1TXQSTAH_TXQCI1_POSN                    equ 0001h
C1TXQSTAH_TXQCI1_POSITION                equ 0001h
C1TXQSTAH_TXQCI1_SIZE                    equ 0001h
C1TXQSTAH_TXQCI1_LENGTH                  equ 0001h
C1TXQSTAH_TXQCI1_MASK                    equ 0002h
C1TXQSTAH_TXQCI2_POSN                    equ 0002h
C1TXQSTAH_TXQCI2_POSITION                equ 0002h
C1TXQSTAH_TXQCI2_SIZE                    equ 0001h
C1TXQSTAH_TXQCI2_LENGTH                  equ 0001h
C1TXQSTAH_TXQCI2_MASK                    equ 0004h
C1TXQSTAH_TXQCI3_POSN                    equ 0003h
C1TXQSTAH_TXQCI3_POSITION                equ 0003h
C1TXQSTAH_TXQCI3_SIZE                    equ 0001h
C1TXQSTAH_TXQCI3_LENGTH                  equ 0001h
C1TXQSTAH_TXQCI3_MASK                    equ 0008h
C1TXQSTAH_TXQCI4_POSN                    equ 0004h
C1TXQSTAH_TXQCI4_POSITION                equ 0004h
C1TXQSTAH_TXQCI4_SIZE                    equ 0001h
C1TXQSTAH_TXQCI4_LENGTH                  equ 0001h
C1TXQSTAH_TXQCI4_MASK                    equ 0010h

// Register: C1TXQSTAU
#define C1TXQSTAU C1TXQSTAU
C1TXQSTAU                                equ 0156h

// Register: C1TXQSTAT
#define C1TXQSTAT C1TXQSTAT
C1TXQSTAT                                equ 0157h

// Register: C1TXQUA
#define C1TXQUA C1TXQUA
C1TXQUA                                  equ 0158h

// Register: C1TXQUAL
#define C1TXQUAL C1TXQUAL
C1TXQUAL                                 equ 0158h
// bitfield definitions
C1TXQUAL_TXQUA_POSN                      equ 0000h
C1TXQUAL_TXQUA_POSITION                  equ 0000h
C1TXQUAL_TXQUA_SIZE                      equ 0008h
C1TXQUAL_TXQUA_LENGTH                    equ 0008h
C1TXQUAL_TXQUA_MASK                      equ 00FFh
C1TXQUAL_TXQUA0_POSN                     equ 0000h
C1TXQUAL_TXQUA0_POSITION                 equ 0000h
C1TXQUAL_TXQUA0_SIZE                     equ 0001h
C1TXQUAL_TXQUA0_LENGTH                   equ 0001h
C1TXQUAL_TXQUA0_MASK                     equ 0001h
C1TXQUAL_TXQUA1_POSN                     equ 0001h
C1TXQUAL_TXQUA1_POSITION                 equ 0001h
C1TXQUAL_TXQUA1_SIZE                     equ 0001h
C1TXQUAL_TXQUA1_LENGTH                   equ 0001h
C1TXQUAL_TXQUA1_MASK                     equ 0002h
C1TXQUAL_TXQUA2_POSN                     equ 0002h
C1TXQUAL_TXQUA2_POSITION                 equ 0002h
C1TXQUAL_TXQUA2_SIZE                     equ 0001h
C1TXQUAL_TXQUA2_LENGTH                   equ 0001h
C1TXQUAL_TXQUA2_MASK                     equ 0004h
C1TXQUAL_TXQUA3_POSN                     equ 0003h
C1TXQUAL_TXQUA3_POSITION                 equ 0003h
C1TXQUAL_TXQUA3_SIZE                     equ 0001h
C1TXQUAL_TXQUA3_LENGTH                   equ 0001h
C1TXQUAL_TXQUA3_MASK                     equ 0008h
C1TXQUAL_TXQUA4_POSN                     equ 0004h
C1TXQUAL_TXQUA4_POSITION                 equ 0004h
C1TXQUAL_TXQUA4_SIZE                     equ 0001h
C1TXQUAL_TXQUA4_LENGTH                   equ 0001h
C1TXQUAL_TXQUA4_MASK                     equ 0010h
C1TXQUAL_TXQUA5_POSN                     equ 0005h
C1TXQUAL_TXQUA5_POSITION                 equ 0005h
C1TXQUAL_TXQUA5_SIZE                     equ 0001h
C1TXQUAL_TXQUA5_LENGTH                   equ 0001h
C1TXQUAL_TXQUA5_MASK                     equ 0020h
C1TXQUAL_TXQUA6_POSN                     equ 0006h
C1TXQUAL_TXQUA6_POSITION                 equ 0006h
C1TXQUAL_TXQUA6_SIZE                     equ 0001h
C1TXQUAL_TXQUA6_LENGTH                   equ 0001h
C1TXQUAL_TXQUA6_MASK                     equ 0040h
C1TXQUAL_TXQUA7_POSN                     equ 0007h
C1TXQUAL_TXQUA7_POSITION                 equ 0007h
C1TXQUAL_TXQUA7_SIZE                     equ 0001h
C1TXQUAL_TXQUA7_LENGTH                   equ 0001h
C1TXQUAL_TXQUA7_MASK                     equ 0080h

// Register: C1TXQUAH
#define C1TXQUAH C1TXQUAH
C1TXQUAH                                 equ 0159h
// bitfield definitions
C1TXQUAH_TXQUA_POSN                      equ 0000h
C1TXQUAH_TXQUA_POSITION                  equ 0000h
C1TXQUAH_TXQUA_SIZE                      equ 0008h
C1TXQUAH_TXQUA_LENGTH                    equ 0008h
C1TXQUAH_TXQUA_MASK                      equ 00FFh
C1TXQUAH_TXQUA8_POSN                     equ 0000h
C1TXQUAH_TXQUA8_POSITION                 equ 0000h
C1TXQUAH_TXQUA8_SIZE                     equ 0001h
C1TXQUAH_TXQUA8_LENGTH                   equ 0001h
C1TXQUAH_TXQUA8_MASK                     equ 0001h
C1TXQUAH_TXQUA9_POSN                     equ 0001h
C1TXQUAH_TXQUA9_POSITION                 equ 0001h
C1TXQUAH_TXQUA9_SIZE                     equ 0001h
C1TXQUAH_TXQUA9_LENGTH                   equ 0001h
C1TXQUAH_TXQUA9_MASK                     equ 0002h
C1TXQUAH_TXQUA10_POSN                    equ 0002h
C1TXQUAH_TXQUA10_POSITION                equ 0002h
C1TXQUAH_TXQUA10_SIZE                    equ 0001h
C1TXQUAH_TXQUA10_LENGTH                  equ 0001h
C1TXQUAH_TXQUA10_MASK                    equ 0004h
C1TXQUAH_TXQUA11_POSN                    equ 0003h
C1TXQUAH_TXQUA11_POSITION                equ 0003h
C1TXQUAH_TXQUA11_SIZE                    equ 0001h
C1TXQUAH_TXQUA11_LENGTH                  equ 0001h
C1TXQUAH_TXQUA11_MASK                    equ 0008h
C1TXQUAH_TXQUA12_POSN                    equ 0004h
C1TXQUAH_TXQUA12_POSITION                equ 0004h
C1TXQUAH_TXQUA12_SIZE                    equ 0001h
C1TXQUAH_TXQUA12_LENGTH                  equ 0001h
C1TXQUAH_TXQUA12_MASK                    equ 0010h
C1TXQUAH_TXQUA13_POSN                    equ 0005h
C1TXQUAH_TXQUA13_POSITION                equ 0005h
C1TXQUAH_TXQUA13_SIZE                    equ 0001h
C1TXQUAH_TXQUA13_LENGTH                  equ 0001h
C1TXQUAH_TXQUA13_MASK                    equ 0020h
C1TXQUAH_TXQUA14_POSN                    equ 0006h
C1TXQUAH_TXQUA14_POSITION                equ 0006h
C1TXQUAH_TXQUA14_SIZE                    equ 0001h
C1TXQUAH_TXQUA14_LENGTH                  equ 0001h
C1TXQUAH_TXQUA14_MASK                    equ 0040h
C1TXQUAH_TXQUA15_POSN                    equ 0007h
C1TXQUAH_TXQUA15_POSITION                equ 0007h
C1TXQUAH_TXQUA15_SIZE                    equ 0001h
C1TXQUAH_TXQUA15_LENGTH                  equ 0001h
C1TXQUAH_TXQUA15_MASK                    equ 0080h

