GopalSaraf/Practicals/PSDL/include/proc/pic18f57q84.inc
// Register: C1FIFOSTA1H
#define C1FIFOSTA1H C1FIFOSTA1H
C1FIFOSTA1H                              equ 0161h
// bitfield definitions
C1FIFOSTA1H_FIFOCI_POSN                  equ 0000h
C1FIFOSTA1H_FIFOCI_POSITION              equ 0000h
C1FIFOSTA1H_FIFOCI_SIZE                  equ 0005h
C1FIFOSTA1H_FIFOCI_LENGTH                equ 0005h
C1FIFOSTA1H_FIFOCI_MASK                  equ 001Fh
C1FIFOSTA1H_FIFOCI0_POSN                 equ 0000h
C1FIFOSTA1H_FIFOCI0_POSITION             equ 0000h
C1FIFOSTA1H_FIFOCI0_SIZE                 equ 0001h
C1FIFOSTA1H_FIFOCI0_LENGTH               equ 0001h
C1FIFOSTA1H_FIFOCI0_MASK                 equ 0001h
C1FIFOSTA1H_FIFOCI1_POSN                 equ 0001h
C1FIFOSTA1H_FIFOCI1_POSITION             equ 0001h
C1FIFOSTA1H_FIFOCI1_SIZE                 equ 0001h
C1FIFOSTA1H_FIFOCI1_LENGTH               equ 0001h
C1FIFOSTA1H_FIFOCI1_MASK                 equ 0002h
C1FIFOSTA1H_FIFOCI2_POSN                 equ 0002h
C1FIFOSTA1H_FIFOCI2_POSITION             equ 0002h
C1FIFOSTA1H_FIFOCI2_SIZE                 equ 0001h
C1FIFOSTA1H_FIFOCI2_LENGTH               equ 0001h
C1FIFOSTA1H_FIFOCI2_MASK                 equ 0004h
C1FIFOSTA1H_FIFOCI3_POSN                 equ 0003h
C1FIFOSTA1H_FIFOCI3_POSITION             equ 0003h
C1FIFOSTA1H_FIFOCI3_SIZE                 equ 0001h
C1FIFOSTA1H_FIFOCI3_LENGTH               equ 0001h
C1FIFOSTA1H_FIFOCI3_MASK                 equ 0008h
C1FIFOSTA1H_FIFOCI4_POSN                 equ 0004h
C1FIFOSTA1H_FIFOCI4_POSITION             equ 0004h
C1FIFOSTA1H_FIFOCI4_SIZE                 equ 0001h
C1FIFOSTA1H_FIFOCI4_LENGTH               equ 0001h
C1FIFOSTA1H_FIFOCI4_MASK                 equ 0010h

// Register: C1FIFOSTA1U
#define C1FIFOSTA1U C1FIFOSTA1U
C1FIFOSTA1U                              equ 0162h

// Register: C1FIFOSTA1T
#define C1FIFOSTA1T C1FIFOSTA1T
C1FIFOSTA1T                              equ 0163h

// Register: C1FIFOUA1
#define C1FIFOUA1 C1FIFOUA1
C1FIFOUA1                                equ 0164h

// Register: C1FIFOUA1L
#define C1FIFOUA1L C1FIFOUA1L
C1FIFOUA1L                               equ 0164h
// bitfield definitions
C1FIFOUA1L_FIFOUA_POSN                   equ 0000h
C1FIFOUA1L_FIFOUA_POSITION               equ 0000h
C1FIFOUA1L_FIFOUA_SIZE                   equ 0008h
C1FIFOUA1L_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA1L_FIFOUA_MASK                   equ 00FFh
C1FIFOUA1L_FIFOUA0_POSN                  equ 0000h
C1FIFOUA1L_FIFOUA0_POSITION              equ 0000h
C1FIFOUA1L_FIFOUA0_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA0_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA0_MASK                  equ 0001h
C1FIFOUA1L_FIFOUA1_POSN                  equ 0001h
C1FIFOUA1L_FIFOUA1_POSITION              equ 0001h
C1FIFOUA1L_FIFOUA1_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA1_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA1_MASK                  equ 0002h
C1FIFOUA1L_FIFOUA2_POSN                  equ 0002h
C1FIFOUA1L_FIFOUA2_POSITION              equ 0002h
C1FIFOUA1L_FIFOUA2_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA2_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA2_MASK                  equ 0004h
C1FIFOUA1L_FIFOUA3_POSN                  equ 0003h
C1FIFOUA1L_FIFOUA3_POSITION              equ 0003h
C1FIFOUA1L_FIFOUA3_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA3_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA3_MASK                  equ 0008h
C1FIFOUA1L_FIFOUA4_POSN                  equ 0004h
C1FIFOUA1L_FIFOUA4_POSITION              equ 0004h
C1FIFOUA1L_FIFOUA4_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA4_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA4_MASK                  equ 0010h
C1FIFOUA1L_FIFOUA5_POSN                  equ 0005h
C1FIFOUA1L_FIFOUA5_POSITION              equ 0005h
C1FIFOUA1L_FIFOUA5_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA5_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA5_MASK                  equ 0020h
C1FIFOUA1L_FIFOUA6_POSN                  equ 0006h
C1FIFOUA1L_FIFOUA6_POSITION              equ 0006h
C1FIFOUA1L_FIFOUA6_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA6_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA6_MASK                  equ 0040h
C1FIFOUA1L_FIFOUA7_POSN                  equ 0007h
C1FIFOUA1L_FIFOUA7_POSITION              equ 0007h
C1FIFOUA1L_FIFOUA7_SIZE                  equ 0001h
C1FIFOUA1L_FIFOUA7_LENGTH                equ 0001h
C1FIFOUA1L_FIFOUA7_MASK                  equ 0080h

// Register: C1FIFOUA1H
#define C1FIFOUA1H C1FIFOUA1H
C1FIFOUA1H                               equ 0165h
// bitfield definitions
C1FIFOUA1H_FIFOUA_POSN                   equ 0000h
C1FIFOUA1H_FIFOUA_POSITION               equ 0000h
C1FIFOUA1H_FIFOUA_SIZE                   equ 0008h
C1FIFOUA1H_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA1H_FIFOUA_MASK                   equ 00FFh
C1FIFOUA1H_FIFOUA8_POSN                  equ 0000h
C1FIFOUA1H_FIFOUA8_POSITION              equ 0000h
C1FIFOUA1H_FIFOUA8_SIZE                  equ 0001h
C1FIFOUA1H_FIFOUA8_LENGTH                equ 0001h
C1FIFOUA1H_FIFOUA8_MASK                  equ 0001h
C1FIFOUA1H_FIFOUA9_POSN                  equ 0001h
C1FIFOUA1H_FIFOUA9_POSITION              equ 0001h
C1FIFOUA1H_FIFOUA9_SIZE                  equ 0001h
C1FIFOUA1H_FIFOUA9_LENGTH                equ 0001h
C1FIFOUA1H_FIFOUA9_MASK                  equ 0002h
C1FIFOUA1H_FIFOUA10_POSN                 equ 0002h
C1FIFOUA1H_FIFOUA10_POSITION             equ 0002h
C1FIFOUA1H_FIFOUA10_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA10_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA10_MASK                 equ 0004h
C1FIFOUA1H_FIFOUA11_POSN                 equ 0003h
C1FIFOUA1H_FIFOUA11_POSITION             equ 0003h
C1FIFOUA1H_FIFOUA11_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA11_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA11_MASK                 equ 0008h
C1FIFOUA1H_FIFOUA12_POSN                 equ 0004h
C1FIFOUA1H_FIFOUA12_POSITION             equ 0004h
C1FIFOUA1H_FIFOUA12_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA12_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA12_MASK                 equ 0010h
C1FIFOUA1H_FIFOUA13_POSN                 equ 0005h
C1FIFOUA1H_FIFOUA13_POSITION             equ 0005h
C1FIFOUA1H_FIFOUA13_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA13_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA13_MASK                 equ 0020h
C1FIFOUA1H_FIFOUA14_POSN                 equ 0006h
C1FIFOUA1H_FIFOUA14_POSITION             equ 0006h
C1FIFOUA1H_FIFOUA14_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA14_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA14_MASK                 equ 0040h
C1FIFOUA1H_FIFOUA15_POSN                 equ 0007h
C1FIFOUA1H_FIFOUA15_POSITION             equ 0007h
C1FIFOUA1H_FIFOUA15_SIZE                 equ 0001h
C1FIFOUA1H_FIFOUA15_LENGTH               equ 0001h
C1FIFOUA1H_FIFOUA15_MASK                 equ 0080h

// Register: C1FIFOUA1U
#define C1FIFOUA1U C1FIFOUA1U
C1FIFOUA1U                               equ 0166h
// bitfield definitions
C1FIFOUA1U_FIFOUA_POSN                   equ 0000h
C1FIFOUA1U_FIFOUA_POSITION               equ 0000h
C1FIFOUA1U_FIFOUA_SIZE                   equ 0008h
C1FIFOUA1U_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA1U_FIFOUA_MASK                   equ 00FFh
C1FIFOUA1U_FIFOUA16_POSN                 equ 0000h
C1FIFOUA1U_FIFOUA16_POSITION             equ 0000h
C1FIFOUA1U_FIFOUA16_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA16_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA16_MASK                 equ 0001h
C1FIFOUA1U_FIFOUA17_POSN                 equ 0001h
C1FIFOUA1U_FIFOUA17_POSITION             equ 0001h
C1FIFOUA1U_FIFOUA17_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA17_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA17_MASK                 equ 0002h
C1FIFOUA1U_FIFOUA18_POSN                 equ 0002h
C1FIFOUA1U_FIFOUA18_POSITION             equ 0002h
C1FIFOUA1U_FIFOUA18_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA18_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA18_MASK                 equ 0004h
C1FIFOUA1U_FIFOUA19_POSN                 equ 0003h
C1FIFOUA1U_FIFOUA19_POSITION             equ 0003h
C1FIFOUA1U_FIFOUA19_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA19_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA19_MASK                 equ 0008h
C1FIFOUA1U_FIFOUA20_POSN                 equ 0004h
C1FIFOUA1U_FIFOUA20_POSITION             equ 0004h
C1FIFOUA1U_FIFOUA20_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA20_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA20_MASK                 equ 0010h
C1FIFOUA1U_FIFOUA21_POSN                 equ 0005h
C1FIFOUA1U_FIFOUA21_POSITION             equ 0005h
C1FIFOUA1U_FIFOUA21_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA21_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA21_MASK                 equ 0020h
C1FIFOUA1U_FIFOUA22_POSN                 equ 0006h
C1FIFOUA1U_FIFOUA22_POSITION             equ 0006h
C1FIFOUA1U_FIFOUA22_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA22_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA22_MASK                 equ 0040h
C1FIFOUA1U_FIFOUA23_POSN                 equ 0007h
C1FIFOUA1U_FIFOUA23_POSITION             equ 0007h
C1FIFOUA1U_FIFOUA23_SIZE                 equ 0001h
C1FIFOUA1U_FIFOUA23_LENGTH               equ 0001h
C1FIFOUA1U_FIFOUA23_MASK                 equ 0080h

// Register: C1FIFOUA1T
#define C1FIFOUA1T C1FIFOUA1T
C1FIFOUA1T                               equ 0167h
// bitfield definitions
C1FIFOUA1T_FIFOUA_POSN                   equ 0000h
C1FIFOUA1T_FIFOUA_POSITION               equ 0000h
C1FIFOUA1T_FIFOUA_SIZE                   equ 0008h
C1FIFOUA1T_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA1T_FIFOUA_MASK                   equ 00FFh
C1FIFOUA1T_FIFOUA24_POSN                 equ 0000h
C1FIFOUA1T_FIFOUA24_POSITION             equ 0000h
C1FIFOUA1T_FIFOUA24_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA24_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA24_MASK                 equ 0001h
C1FIFOUA1T_FIFOUA25_POSN                 equ 0001h
C1FIFOUA1T_FIFOUA25_POSITION             equ 0001h
C1FIFOUA1T_FIFOUA25_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA25_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA25_MASK                 equ 0002h
C1FIFOUA1T_FIFOUA26_POSN                 equ 0002h
C1FIFOUA1T_FIFOUA26_POSITION             equ 0002h
C1FIFOUA1T_FIFOUA26_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA26_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA26_MASK                 equ 0004h
C1FIFOUA1T_FIFOUA27_POSN                 equ 0003h
C1FIFOUA1T_FIFOUA27_POSITION             equ 0003h
C1FIFOUA1T_FIFOUA27_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA27_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA27_MASK                 equ 0008h
C1FIFOUA1T_FIFOUA28_POSN                 equ 0004h
C1FIFOUA1T_FIFOUA28_POSITION             equ 0004h
C1FIFOUA1T_FIFOUA28_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA28_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA28_MASK                 equ 0010h
C1FIFOUA1T_FIFOUA29_POSN                 equ 0005h
C1FIFOUA1T_FIFOUA29_POSITION             equ 0005h
C1FIFOUA1T_FIFOUA29_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA29_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA29_MASK                 equ 0020h
C1FIFOUA1T_FIFOUA30_POSN                 equ 0006h
C1FIFOUA1T_FIFOUA30_POSITION             equ 0006h
C1FIFOUA1T_FIFOUA30_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA30_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA30_MASK                 equ 0040h
C1FIFOUA1T_FIFOUA31_POSN                 equ 0007h
C1FIFOUA1T_FIFOUA31_POSITION             equ 0007h
C1FIFOUA1T_FIFOUA31_SIZE                 equ 0001h
C1FIFOUA1T_FIFOUA31_LENGTH               equ 0001h
C1FIFOUA1T_FIFOUA31_MASK                 equ 0080h

// Register: C1FIFOCON2
#define C1FIFOCON2 C1FIFOCON2
C1FIFOCON2                               equ 0168h

// Register: C1FIFOCON2L
#define C1FIFOCON2L C1FIFOCON2L
C1FIFOCON2L                              equ 0168h
// bitfield definitions
C1FIFOCON2L_TFNRFNIE_POSN                equ 0000h
C1FIFOCON2L_TFNRFNIE_POSITION            equ 0000h
C1FIFOCON2L_TFNRFNIE_SIZE                equ 0001h
C1FIFOCON2L_TFNRFNIE_LENGTH              equ 0001h
C1FIFOCON2L_TFNRFNIE_MASK                equ 0001h
C1FIFOCON2L_TFHRFHIE_POSN                equ 0001h
C1FIFOCON2L_TFHRFHIE_POSITION            equ 0001h
C1FIFOCON2L_TFHRFHIE_SIZE                equ 0001h
C1FIFOCON2L_TFHRFHIE_LENGTH              equ 0001h
C1FIFOCON2L_TFHRFHIE_MASK                equ 0002h
C1FIFOCON2L_TFERFFIE_POSN                equ 0002h
C1FIFOCON2L_TFERFFIE_POSITION            equ 0002h
C1FIFOCON2L_TFERFFIE_SIZE                equ 0001h
C1FIFOCON2L_TFERFFIE_LENGTH              equ 0001h
C1FIFOCON2L_TFERFFIE_MASK                equ 0004h
C1FIFOCON2L_RXOVIE_POSN                  equ 0003h
C1FIFOCON2L_RXOVIE_POSITION              equ 0003h
C1FIFOCON2L_RXOVIE_SIZE                  equ 0001h
C1FIFOCON2L_RXOVIE_LENGTH                equ 0001h
C1FIFOCON2L_RXOVIE_MASK                  equ 0008h
C1FIFOCON2L_TXATIE_POSN                  equ 0004h
C1FIFOCON2L_TXATIE_POSITION              equ 0004h
C1FIFOCON2L_TXATIE_SIZE                  equ 0001h
C1FIFOCON2L_TXATIE_LENGTH                equ 0001h
C1FIFOCON2L_TXATIE_MASK                  equ 0010h
C1FIFOCON2L_RXTSEN_POSN                  equ 0005h
C1FIFOCON2L_RXTSEN_POSITION              equ 0005h
C1FIFOCON2L_RXTSEN_SIZE                  equ 0001h
C1FIFOCON2L_RXTSEN_LENGTH                equ 0001h
C1FIFOCON2L_RXTSEN_MASK                  equ 0020h
C1FIFOCON2L_RTREN_POSN                   equ 0006h
C1FIFOCON2L_RTREN_POSITION               equ 0006h
C1FIFOCON2L_RTREN_SIZE                   equ 0001h
C1FIFOCON2L_RTREN_LENGTH                 equ 0001h
C1FIFOCON2L_RTREN_MASK                   equ 0040h
C1FIFOCON2L_TXEN_POSN                    equ 0007h
C1FIFOCON2L_TXEN_POSITION                equ 0007h
C1FIFOCON2L_TXEN_SIZE                    equ 0001h
C1FIFOCON2L_TXEN_LENGTH                  equ 0001h
C1FIFOCON2L_TXEN_MASK                    equ 0080h

// Register: C1FIFOCON2H
#define C1FIFOCON2H C1FIFOCON2H
C1FIFOCON2H                              equ 0169h
// bitfield definitions
C1FIFOCON2H_UINC_POSN                    equ 0000h
C1FIFOCON2H_UINC_POSITION                equ 0000h
C1FIFOCON2H_UINC_SIZE                    equ 0001h
C1FIFOCON2H_UINC_LENGTH                  equ 0001h
C1FIFOCON2H_UINC_MASK                    equ 0001h
C1FIFOCON2H_TXREQ_POSN                   equ 0001h
C1FIFOCON2H_TXREQ_POSITION               equ 0001h
C1FIFOCON2H_TXREQ_SIZE                   equ 0001h
C1FIFOCON2H_TXREQ_LENGTH                 equ 0001h
C1FIFOCON2H_TXREQ_MASK                   equ 0002h
C1FIFOCON2H_FRESET_POSN                  equ 0002h
C1FIFOCON2H_FRESET_POSITION              equ 0002h
C1FIFOCON2H_FRESET_SIZE                  equ 0001h
C1FIFOCON2H_FRESET_LENGTH                equ 0001h
C1FIFOCON2H_FRESET_MASK                  equ 0004h

// Register: C1FIFOCON2U
#define C1FIFOCON2U C1FIFOCON2U
C1FIFOCON2U                              equ 016Ah
// bitfield definitions
C1FIFOCON2U_TXPRI_POSN                   equ 0000h
C1FIFOCON2U_TXPRI_POSITION               equ 0000h
C1FIFOCON2U_TXPRI_SIZE                   equ 0005h
C1FIFOCON2U_TXPRI_LENGTH                 equ 0005h
C1FIFOCON2U_TXPRI_MASK                   equ 001Fh
C1FIFOCON2U_TXAT_POSN                    equ 0005h
C1FIFOCON2U_TXAT_POSITION                equ 0005h
C1FIFOCON2U_TXAT_SIZE                    equ 0002h
C1FIFOCON2U_TXAT_LENGTH                  equ 0002h
C1FIFOCON2U_TXAT_MASK                    equ 0060h
C1FIFOCON2U_TXPRI0_POSN                  equ 0000h
C1FIFOCON2U_TXPRI0_POSITION              equ 0000h
C1FIFOCON2U_TXPRI0_SIZE                  equ 0001h
C1FIFOCON2U_TXPRI0_LENGTH                equ 0001h
C1FIFOCON2U_TXPRI0_MASK                  equ 0001h
C1FIFOCON2U_TXPRI1_POSN                  equ 0001h
C1FIFOCON2U_TXPRI1_POSITION              equ 0001h
C1FIFOCON2U_TXPRI1_SIZE                  equ 0001h
C1FIFOCON2U_TXPRI1_LENGTH                equ 0001h
C1FIFOCON2U_TXPRI1_MASK                  equ 0002h
C1FIFOCON2U_TXPRI2_POSN                  equ 0002h
C1FIFOCON2U_TXPRI2_POSITION              equ 0002h
C1FIFOCON2U_TXPRI2_SIZE                  equ 0001h
C1FIFOCON2U_TXPRI2_LENGTH                equ 0001h
C1FIFOCON2U_TXPRI2_MASK                  equ 0004h
C1FIFOCON2U_TXPRI3_POSN                  equ 0003h
C1FIFOCON2U_TXPRI3_POSITION              equ 0003h
C1FIFOCON2U_TXPRI3_SIZE                  equ 0001h
C1FIFOCON2U_TXPRI3_LENGTH                equ 0001h
C1FIFOCON2U_TXPRI3_MASK                  equ 0008h
C1FIFOCON2U_TXPRI4_POSN                  equ 0004h
C1FIFOCON2U_TXPRI4_POSITION              equ 0004h
C1FIFOCON2U_TXPRI4_SIZE                  equ 0001h
C1FIFOCON2U_TXPRI4_LENGTH                equ 0001h
C1FIFOCON2U_TXPRI4_MASK                  equ 0010h
C1FIFOCON2U_TXAT0_POSN                   equ 0005h
C1FIFOCON2U_TXAT0_POSITION               equ 0005h
C1FIFOCON2U_TXAT0_SIZE                   equ 0001h
C1FIFOCON2U_TXAT0_LENGTH                 equ 0001h
C1FIFOCON2U_TXAT0_MASK                   equ 0020h
C1FIFOCON2U_TXAT1_POSN                   equ 0006h
C1FIFOCON2U_TXAT1_POSITION               equ 0006h
C1FIFOCON2U_TXAT1_SIZE                   equ 0001h
C1FIFOCON2U_TXAT1_LENGTH                 equ 0001h
C1FIFOCON2U_TXAT1_MASK                   equ 0040h

// Register: C1FIFOCON2T
#define C1FIFOCON2T C1FIFOCON2T
C1FIFOCON2T                              equ 016Bh
// bitfield definitions
C1FIFOCON2T_FSIZE_POSN                   equ 0000h
C1FIFOCON2T_FSIZE_POSITION               equ 0000h
C1FIFOCON2T_FSIZE_SIZE                   equ 0005h
C1FIFOCON2T_FSIZE_LENGTH                 equ 0005h
C1FIFOCON2T_FSIZE_MASK                   equ 001Fh
C1FIFOCON2T_PLSIZE_POSN                  equ 0005h
C1FIFOCON2T_PLSIZE_POSITION              equ 0005h
C1FIFOCON2T_PLSIZE_SIZE                  equ 0003h
C1FIFOCON2T_PLSIZE_LENGTH                equ 0003h
C1FIFOCON2T_PLSIZE_MASK                  equ 00E0h
C1FIFOCON2T_FSIZE0_POSN                  equ 0000h
C1FIFOCON2T_FSIZE0_POSITION              equ 0000h
C1FIFOCON2T_FSIZE0_SIZE                  equ 0001h
C1FIFOCON2T_FSIZE0_LENGTH                equ 0001h
C1FIFOCON2T_FSIZE0_MASK                  equ 0001h
C1FIFOCON2T_FSIZE1_POSN                  equ 0001h
C1FIFOCON2T_FSIZE1_POSITION              equ 0001h
C1FIFOCON2T_FSIZE1_SIZE                  equ 0001h
C1FIFOCON2T_FSIZE1_LENGTH                equ 0001h
C1FIFOCON2T_FSIZE1_MASK                  equ 0002h
C1FIFOCON2T_FSIZE2_POSN                  equ 0002h
C1FIFOCON2T_FSIZE2_POSITION              equ 0002h
C1FIFOCON2T_FSIZE2_SIZE                  equ 0001h
C1FIFOCON2T_FSIZE2_LENGTH                equ 0001h
C1FIFOCON2T_FSIZE2_MASK                  equ 0004h
C1FIFOCON2T_FSIZE3_POSN                  equ 0003h
C1FIFOCON2T_FSIZE3_POSITION              equ 0003h
C1FIFOCON2T_FSIZE3_SIZE                  equ 0001h
C1FIFOCON2T_FSIZE3_LENGTH                equ 0001h
C1FIFOCON2T_FSIZE3_MASK                  equ 0008h
C1FIFOCON2T_FSIZE4_POSN                  equ 0004h
C1FIFOCON2T_FSIZE4_POSITION              equ 0004h
C1FIFOCON2T_FSIZE4_SIZE                  equ 0001h
C1FIFOCON2T_FSIZE4_LENGTH                equ 0001h
C1FIFOCON2T_FSIZE4_MASK                  equ 0010h
C1FIFOCON2T_PLSIZE0_POSN                 equ 0005h
C1FIFOCON2T_PLSIZE0_POSITION             equ 0005h
C1FIFOCON2T_PLSIZE0_SIZE                 equ 0001h
C1FIFOCON2T_PLSIZE0_LENGTH               equ 0001h
C1FIFOCON2T_PLSIZE0_MASK                 equ 0020h
C1FIFOCON2T_PLSIZE1_POSN                 equ 0006h
C1FIFOCON2T_PLSIZE1_POSITION             equ 0006h
C1FIFOCON2T_PLSIZE1_SIZE                 equ 0001h
C1FIFOCON2T_PLSIZE1_LENGTH               equ 0001h
C1FIFOCON2T_PLSIZE1_MASK                 equ 0040h
C1FIFOCON2T_PLSIZE2_POSN                 equ 0007h
C1FIFOCON2T_PLSIZE2_POSITION             equ 0007h
C1FIFOCON2T_PLSIZE2_SIZE                 equ 0001h
C1FIFOCON2T_PLSIZE2_LENGTH               equ 0001h
C1FIFOCON2T_PLSIZE2_MASK                 equ 0080h

// Register: C1FIFOSTA2
#define C1FIFOSTA2 C1FIFOSTA2
C1FIFOSTA2                               equ 016Ch

// Register: C1FIFOSTA2L
#define C1FIFOSTA2L C1FIFOSTA2L
C1FIFOSTA2L                              equ 016Ch
// bitfield definitions
C1FIFOSTA2L_TFNRFNIF_POSN                equ 0000h
C1FIFOSTA2L_TFNRFNIF_POSITION            equ 0000h
C1FIFOSTA2L_TFNRFNIF_SIZE                equ 0001h
C1FIFOSTA2L_TFNRFNIF_LENGTH              equ 0001h
C1FIFOSTA2L_TFNRFNIF_MASK                equ 0001h
C1FIFOSTA2L_TFHRFHIF_POSN                equ 0001h
C1FIFOSTA2L_TFHRFHIF_POSITION            equ 0001h
C1FIFOSTA2L_TFHRFHIF_SIZE                equ 0001h
C1FIFOSTA2L_TFHRFHIF_LENGTH              equ 0001h
C1FIFOSTA2L_TFHRFHIF_MASK                equ 0002h
C1FIFOSTA2L_TFERFFIF_POSN                equ 0002h
C1FIFOSTA2L_TFERFFIF_POSITION            equ 0002h
C1FIFOSTA2L_TFERFFIF_SIZE                equ 0001h
C1FIFOSTA2L_TFERFFIF_LENGTH              equ 0001h
C1FIFOSTA2L_TFERFFIF_MASK                equ 0004h
C1FIFOSTA2L_RXOVIF_POSN                  equ 0003h
C1FIFOSTA2L_RXOVIF_POSITION              equ 0003h
C1FIFOSTA2L_RXOVIF_SIZE                  equ 0001h
C1FIFOSTA2L_RXOVIF_LENGTH                equ 0001h
C1FIFOSTA2L_RXOVIF_MASK                  equ 0008h
C1FIFOSTA2L_TXATIF_POSN                  equ 0004h
C1FIFOSTA2L_TXATIF_POSITION              equ 0004h
C1FIFOSTA2L_TXATIF_SIZE                  equ 0001h
C1FIFOSTA2L_TXATIF_LENGTH                equ 0001h
C1FIFOSTA2L_TXATIF_MASK                  equ 0010h
C1FIFOSTA2L_TXERR_POSN                   equ 0005h
C1FIFOSTA2L_TXERR_POSITION               equ 0005h
C1FIFOSTA2L_TXERR_SIZE                   equ 0001h
C1FIFOSTA2L_TXERR_LENGTH                 equ 0001h
C1FIFOSTA2L_TXERR_MASK                   equ 0020h
C1FIFOSTA2L_TXLARB_POSN                  equ 0006h
C1FIFOSTA2L_TXLARB_POSITION              equ 0006h
C1FIFOSTA2L_TXLARB_SIZE                  equ 0001h
C1FIFOSTA2L_TXLARB_LENGTH                equ 0001h
C1FIFOSTA2L_TXLARB_MASK                  equ 0040h
C1FIFOSTA2L_TXABT_POSN                   equ 0007h
C1FIFOSTA2L_TXABT_POSITION               equ 0007h
C1FIFOSTA2L_TXABT_SIZE                   equ 0001h
C1FIFOSTA2L_TXABT_LENGTH                 equ 0001h
C1FIFOSTA2L_TXABT_MASK                   equ 0080h

// Register: C1FIFOSTA2H
#define C1FIFOSTA2H C1FIFOSTA2H
C1FIFOSTA2H                              equ 016Dh
// bitfield definitions
C1FIFOSTA2H_FIFOCI_POSN                  equ 0000h
C1FIFOSTA2H_FIFOCI_POSITION              equ 0000h
C1FIFOSTA2H_FIFOCI_SIZE                  equ 0005h
C1FIFOSTA2H_FIFOCI_LENGTH                equ 0005h
C1FIFOSTA2H_FIFOCI_MASK                  equ 001Fh
C1FIFOSTA2H_FIFOCI0_POSN                 equ 0000h
C1FIFOSTA2H_FIFOCI0_POSITION             equ 0000h
C1FIFOSTA2H_FIFOCI0_SIZE                 equ 0001h
C1FIFOSTA2H_FIFOCI0_LENGTH               equ 0001h
C1FIFOSTA2H_FIFOCI0_MASK                 equ 0001h
C1FIFOSTA2H_FIFOCI1_POSN                 equ 0001h
C1FIFOSTA2H_FIFOCI1_POSITION             equ 0001h
C1FIFOSTA2H_FIFOCI1_SIZE                 equ 0001h
C1FIFOSTA2H_FIFOCI1_LENGTH               equ 0001h
C1FIFOSTA2H_FIFOCI1_MASK                 equ 0002h
C1FIFOSTA2H_FIFOCI2_POSN                 equ 0002h
C1FIFOSTA2H_FIFOCI2_POSITION             equ 0002h
C1FIFOSTA2H_FIFOCI2_SIZE                 equ 0001h
C1FIFOSTA2H_FIFOCI2_LENGTH               equ 0001h
C1FIFOSTA2H_FIFOCI2_MASK                 equ 0004h
C1FIFOSTA2H_FIFOCI3_POSN                 equ 0003h
C1FIFOSTA2H_FIFOCI3_POSITION             equ 0003h
C1FIFOSTA2H_FIFOCI3_SIZE                 equ 0001h
C1FIFOSTA2H_FIFOCI3_LENGTH               equ 0001h
C1FIFOSTA2H_FIFOCI3_MASK                 equ 0008h
C1FIFOSTA2H_FIFOCI4_POSN                 equ 0004h
C1FIFOSTA2H_FIFOCI4_POSITION             equ 0004h
C1FIFOSTA2H_FIFOCI4_SIZE                 equ 0001h
C1FIFOSTA2H_FIFOCI4_LENGTH               equ 0001h
C1FIFOSTA2H_FIFOCI4_MASK                 equ 0010h

