GopalSaraf/Practicals/PSDL/include/proc/pic18f57q84.inc
// Register: C1MASK10T
#define C1MASK10T C1MASK10T
C1MASK10T                                equ 01E3h
// bitfield definitions
C1MASK10T_MEID_POSN                      equ 0000h
C1MASK10T_MEID_POSITION                  equ 0000h
C1MASK10T_MEID_SIZE                      equ 0005h
C1MASK10T_MEID_LENGTH                    equ 0005h
C1MASK10T_MEID_MASK                      equ 001Fh
C1MASK10T_MSID11_POSN                    equ 0005h
C1MASK10T_MSID11_POSITION                equ 0005h
C1MASK10T_MSID11_SIZE                    equ 0001h
C1MASK10T_MSID11_LENGTH                  equ 0001h
C1MASK10T_MSID11_MASK                    equ 0020h
C1MASK10T_MIDE_POSN                      equ 0006h
C1MASK10T_MIDE_POSITION                  equ 0006h
C1MASK10T_MIDE_SIZE                      equ 0001h
C1MASK10T_MIDE_LENGTH                    equ 0001h
C1MASK10T_MIDE_MASK                      equ 0040h
C1MASK10T_MEID13_POSN                    equ 0000h
C1MASK10T_MEID13_POSITION                equ 0000h
C1MASK10T_MEID13_SIZE                    equ 0001h
C1MASK10T_MEID13_LENGTH                  equ 0001h
C1MASK10T_MEID13_MASK                    equ 0001h
C1MASK10T_MEID14_POSN                    equ 0001h
C1MASK10T_MEID14_POSITION                equ 0001h
C1MASK10T_MEID14_SIZE                    equ 0001h
C1MASK10T_MEID14_LENGTH                  equ 0001h
C1MASK10T_MEID14_MASK                    equ 0002h
C1MASK10T_MEID15_POSN                    equ 0002h
C1MASK10T_MEID15_POSITION                equ 0002h
C1MASK10T_MEID15_SIZE                    equ 0001h
C1MASK10T_MEID15_LENGTH                  equ 0001h
C1MASK10T_MEID15_MASK                    equ 0004h
C1MASK10T_MEID16_POSN                    equ 0003h
C1MASK10T_MEID16_POSITION                equ 0003h
C1MASK10T_MEID16_SIZE                    equ 0001h
C1MASK10T_MEID16_LENGTH                  equ 0001h
C1MASK10T_MEID16_MASK                    equ 0008h
C1MASK10T_MEID17_POSN                    equ 0004h
C1MASK10T_MEID17_POSITION                equ 0004h
C1MASK10T_MEID17_SIZE                    equ 0001h
C1MASK10T_MEID17_LENGTH                  equ 0001h
C1MASK10T_MEID17_MASK                    equ 0010h

// Register: C1FLTOBJ11
#define C1FLTOBJ11 C1FLTOBJ11
C1FLTOBJ11                               equ 01E4h

// Register: C1FLTOBJ11L
#define C1FLTOBJ11L C1FLTOBJ11L
C1FLTOBJ11L                              equ 01E4h
// bitfield definitions
C1FLTOBJ11L_SID_POSN                     equ 0000h
C1FLTOBJ11L_SID_POSITION                 equ 0000h
C1FLTOBJ11L_SID_SIZE                     equ 0008h
C1FLTOBJ11L_SID_LENGTH                   equ 0008h
C1FLTOBJ11L_SID_MASK                     equ 00FFh
C1FLTOBJ11L_SID0_POSN                    equ 0000h
C1FLTOBJ11L_SID0_POSITION                equ 0000h
C1FLTOBJ11L_SID0_SIZE                    equ 0001h
C1FLTOBJ11L_SID0_LENGTH                  equ 0001h
C1FLTOBJ11L_SID0_MASK                    equ 0001h
C1FLTOBJ11L_SID1_POSN                    equ 0001h
C1FLTOBJ11L_SID1_POSITION                equ 0001h
C1FLTOBJ11L_SID1_SIZE                    equ 0001h
C1FLTOBJ11L_SID1_LENGTH                  equ 0001h
C1FLTOBJ11L_SID1_MASK                    equ 0002h
C1FLTOBJ11L_SID2_POSN                    equ 0002h
C1FLTOBJ11L_SID2_POSITION                equ 0002h
C1FLTOBJ11L_SID2_SIZE                    equ 0001h
C1FLTOBJ11L_SID2_LENGTH                  equ 0001h
C1FLTOBJ11L_SID2_MASK                    equ 0004h
C1FLTOBJ11L_SID3_POSN                    equ 0003h
C1FLTOBJ11L_SID3_POSITION                equ 0003h
C1FLTOBJ11L_SID3_SIZE                    equ 0001h
C1FLTOBJ11L_SID3_LENGTH                  equ 0001h
C1FLTOBJ11L_SID3_MASK                    equ 0008h
C1FLTOBJ11L_SID4_POSN                    equ 0004h
C1FLTOBJ11L_SID4_POSITION                equ 0004h
C1FLTOBJ11L_SID4_SIZE                    equ 0001h
C1FLTOBJ11L_SID4_LENGTH                  equ 0001h
C1FLTOBJ11L_SID4_MASK                    equ 0010h
C1FLTOBJ11L_SID5_POSN                    equ 0005h
C1FLTOBJ11L_SID5_POSITION                equ 0005h
C1FLTOBJ11L_SID5_SIZE                    equ 0001h
C1FLTOBJ11L_SID5_LENGTH                  equ 0001h
C1FLTOBJ11L_SID5_MASK                    equ 0020h
C1FLTOBJ11L_SID6_POSN                    equ 0006h
C1FLTOBJ11L_SID6_POSITION                equ 0006h
C1FLTOBJ11L_SID6_SIZE                    equ 0001h
C1FLTOBJ11L_SID6_LENGTH                  equ 0001h
C1FLTOBJ11L_SID6_MASK                    equ 0040h
C1FLTOBJ11L_SID7_POSN                    equ 0007h
C1FLTOBJ11L_SID7_POSITION                equ 0007h
C1FLTOBJ11L_SID7_SIZE                    equ 0001h
C1FLTOBJ11L_SID7_LENGTH                  equ 0001h
C1FLTOBJ11L_SID7_MASK                    equ 0080h

// Register: C1FLTOBJ11H
#define C1FLTOBJ11H C1FLTOBJ11H
C1FLTOBJ11H                              equ 01E5h
// bitfield definitions
C1FLTOBJ11H_SID_POSN                     equ 0000h
C1FLTOBJ11H_SID_POSITION                 equ 0000h
C1FLTOBJ11H_SID_SIZE                     equ 0003h
C1FLTOBJ11H_SID_LENGTH                   equ 0003h
C1FLTOBJ11H_SID_MASK                     equ 0007h
C1FLTOBJ11H_EID_POSN                     equ 0003h
C1FLTOBJ11H_EID_POSITION                 equ 0003h
C1FLTOBJ11H_EID_SIZE                     equ 0005h
C1FLTOBJ11H_EID_LENGTH                   equ 0005h
C1FLTOBJ11H_EID_MASK                     equ 00F8h
C1FLTOBJ11H_SID8_POSN                    equ 0000h
C1FLTOBJ11H_SID8_POSITION                equ 0000h
C1FLTOBJ11H_SID8_SIZE                    equ 0001h
C1FLTOBJ11H_SID8_LENGTH                  equ 0001h
C1FLTOBJ11H_SID8_MASK                    equ 0001h
C1FLTOBJ11H_SID9_POSN                    equ 0001h
C1FLTOBJ11H_SID9_POSITION                equ 0001h
C1FLTOBJ11H_SID9_SIZE                    equ 0001h
C1FLTOBJ11H_SID9_LENGTH                  equ 0001h
C1FLTOBJ11H_SID9_MASK                    equ 0002h
C1FLTOBJ11H_SID10_POSN                   equ 0002h
C1FLTOBJ11H_SID10_POSITION               equ 0002h
C1FLTOBJ11H_SID10_SIZE                   equ 0001h
C1FLTOBJ11H_SID10_LENGTH                 equ 0001h
C1FLTOBJ11H_SID10_MASK                   equ 0004h
C1FLTOBJ11H_EID0_POSN                    equ 0003h
C1FLTOBJ11H_EID0_POSITION                equ 0003h
C1FLTOBJ11H_EID0_SIZE                    equ 0001h
C1FLTOBJ11H_EID0_LENGTH                  equ 0001h
C1FLTOBJ11H_EID0_MASK                    equ 0008h
C1FLTOBJ11H_EID1_POSN                    equ 0004h
C1FLTOBJ11H_EID1_POSITION                equ 0004h
C1FLTOBJ11H_EID1_SIZE                    equ 0001h
C1FLTOBJ11H_EID1_LENGTH                  equ 0001h
C1FLTOBJ11H_EID1_MASK                    equ 0010h
C1FLTOBJ11H_EID2_POSN                    equ 0005h
C1FLTOBJ11H_EID2_POSITION                equ 0005h
C1FLTOBJ11H_EID2_SIZE                    equ 0001h
C1FLTOBJ11H_EID2_LENGTH                  equ 0001h
C1FLTOBJ11H_EID2_MASK                    equ 0020h
C1FLTOBJ11H_EID3_POSN                    equ 0006h
C1FLTOBJ11H_EID3_POSITION                equ 0006h
C1FLTOBJ11H_EID3_SIZE                    equ 0001h
C1FLTOBJ11H_EID3_LENGTH                  equ 0001h
C1FLTOBJ11H_EID3_MASK                    equ 0040h
C1FLTOBJ11H_EID4_POSN                    equ 0007h
C1FLTOBJ11H_EID4_POSITION                equ 0007h
C1FLTOBJ11H_EID4_SIZE                    equ 0001h
C1FLTOBJ11H_EID4_LENGTH                  equ 0001h
C1FLTOBJ11H_EID4_MASK                    equ 0080h

