GopalSaraf/Practicals/PSDL/include/proc/pic18f57q84.inc
// Register: IVTBASE
#define IVTBASE IVTBASE
IVTBASE                                  equ 045Dh

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
IVTBASEL                                 equ 045Dh
// bitfield definitions
IVTBASEL_BASE0_POSN                      equ 0000h
IVTBASEL_BASE0_POSITION                  equ 0000h
IVTBASEL_BASE0_SIZE                      equ 0001h
IVTBASEL_BASE0_LENGTH                    equ 0001h
IVTBASEL_BASE0_MASK                      equ 0001h
IVTBASEL_BASE1_POSN                      equ 0001h
IVTBASEL_BASE1_POSITION                  equ 0001h
IVTBASEL_BASE1_SIZE                      equ 0001h
IVTBASEL_BASE1_LENGTH                    equ 0001h
IVTBASEL_BASE1_MASK                      equ 0002h
IVTBASEL_BASE2_POSN                      equ 0002h
IVTBASEL_BASE2_POSITION                  equ 0002h
IVTBASEL_BASE2_SIZE                      equ 0001h
IVTBASEL_BASE2_LENGTH                    equ 0001h
IVTBASEL_BASE2_MASK                      equ 0004h
IVTBASEL_BASE3_POSN                      equ 0003h
IVTBASEL_BASE3_POSITION                  equ 0003h
IVTBASEL_BASE3_SIZE                      equ 0001h
IVTBASEL_BASE3_LENGTH                    equ 0001h
IVTBASEL_BASE3_MASK                      equ 0008h
IVTBASEL_BASE4_POSN                      equ 0004h
IVTBASEL_BASE4_POSITION                  equ 0004h
IVTBASEL_BASE4_SIZE                      equ 0001h
IVTBASEL_BASE4_LENGTH                    equ 0001h
IVTBASEL_BASE4_MASK                      equ 0010h
IVTBASEL_BASE5_POSN                      equ 0005h
IVTBASEL_BASE5_POSITION                  equ 0005h
IVTBASEL_BASE5_SIZE                      equ 0001h
IVTBASEL_BASE5_LENGTH                    equ 0001h
IVTBASEL_BASE5_MASK                      equ 0020h
IVTBASEL_BASE6_POSN                      equ 0006h
IVTBASEL_BASE6_POSITION                  equ 0006h
IVTBASEL_BASE6_SIZE                      equ 0001h
IVTBASEL_BASE6_LENGTH                    equ 0001h
IVTBASEL_BASE6_MASK                      equ 0040h
IVTBASEL_BASE7_POSN                      equ 0007h
IVTBASEL_BASE7_POSITION                  equ 0007h
IVTBASEL_BASE7_SIZE                      equ 0001h
IVTBASEL_BASE7_LENGTH                    equ 0001h
IVTBASEL_BASE7_MASK                      equ 0080h

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
IVTBASEH                                 equ 045Eh
// bitfield definitions
IVTBASEH_BASE8_POSN                      equ 0000h
IVTBASEH_BASE8_POSITION                  equ 0000h
IVTBASEH_BASE8_SIZE                      equ 0001h
IVTBASEH_BASE8_LENGTH                    equ 0001h
IVTBASEH_BASE8_MASK                      equ 0001h
IVTBASEH_BASE9_POSN                      equ 0001h
IVTBASEH_BASE9_POSITION                  equ 0001h
IVTBASEH_BASE9_SIZE                      equ 0001h
IVTBASEH_BASE9_LENGTH                    equ 0001h
IVTBASEH_BASE9_MASK                      equ 0002h
IVTBASEH_BASE10_POSN                     equ 0002h
IVTBASEH_BASE10_POSITION                 equ 0002h
IVTBASEH_BASE10_SIZE                     equ 0001h
IVTBASEH_BASE10_LENGTH                   equ 0001h
IVTBASEH_BASE10_MASK                     equ 0004h
IVTBASEH_BASE11_POSN                     equ 0003h
IVTBASEH_BASE11_POSITION                 equ 0003h
IVTBASEH_BASE11_SIZE                     equ 0001h
IVTBASEH_BASE11_LENGTH                   equ 0001h
IVTBASEH_BASE11_MASK                     equ 0008h
IVTBASEH_BASE12_POSN                     equ 0004h
IVTBASEH_BASE12_POSITION                 equ 0004h
IVTBASEH_BASE12_SIZE                     equ 0001h
IVTBASEH_BASE12_LENGTH                   equ 0001h
IVTBASEH_BASE12_MASK                     equ 0010h
IVTBASEH_BASE13_POSN                     equ 0005h
IVTBASEH_BASE13_POSITION                 equ 0005h
IVTBASEH_BASE13_SIZE                     equ 0001h
IVTBASEH_BASE13_LENGTH                   equ 0001h
IVTBASEH_BASE13_MASK                     equ 0020h
IVTBASEH_BASE14_POSN                     equ 0006h
IVTBASEH_BASE14_POSITION                 equ 0006h
IVTBASEH_BASE14_SIZE                     equ 0001h
IVTBASEH_BASE14_LENGTH                   equ 0001h
IVTBASEH_BASE14_MASK                     equ 0040h
IVTBASEH_BASE15_POSN                     equ 0007h
IVTBASEH_BASE15_POSITION                 equ 0007h
IVTBASEH_BASE15_SIZE                     equ 0001h
IVTBASEH_BASE15_LENGTH                   equ 0001h
IVTBASEH_BASE15_MASK                     equ 0080h

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
IVTBASEU                                 equ 045Fh
// bitfield definitions
IVTBASEU_BASE16_POSN                     equ 0000h
IVTBASEU_BASE16_POSITION                 equ 0000h
IVTBASEU_BASE16_SIZE                     equ 0001h
IVTBASEU_BASE16_LENGTH                   equ 0001h
IVTBASEU_BASE16_MASK                     equ 0001h
IVTBASEU_BASE17_POSN                     equ 0001h
IVTBASEU_BASE17_POSITION                 equ 0001h
IVTBASEU_BASE17_SIZE                     equ 0001h
IVTBASEU_BASE17_LENGTH                   equ 0001h
IVTBASEU_BASE17_MASK                     equ 0002h
IVTBASEU_BASE18_POSN                     equ 0002h
IVTBASEU_BASE18_POSITION                 equ 0002h
IVTBASEU_BASE18_SIZE                     equ 0001h
IVTBASEU_BASE18_LENGTH                   equ 0001h
IVTBASEU_BASE18_MASK                     equ 0004h
IVTBASEU_BASE19_POSN                     equ 0003h
IVTBASEU_BASE19_POSITION                 equ 0003h
IVTBASEU_BASE19_SIZE                     equ 0001h
IVTBASEU_BASE19_LENGTH                   equ 0001h
IVTBASEU_BASE19_MASK                     equ 0008h
IVTBASEU_BASE20_POSN                     equ 0004h
IVTBASEU_BASE20_POSITION                 equ 0004h
IVTBASEU_BASE20_SIZE                     equ 0001h
IVTBASEU_BASE20_LENGTH                   equ 0001h
IVTBASEU_BASE20_MASK                     equ 0010h

// Register: PWM1ERS
#define PWM1ERS PWM1ERS
PWM1ERS                                  equ 0460h
// bitfield definitions
PWM1ERS_ERS_POSN                         equ 0000h
PWM1ERS_ERS_POSITION                     equ 0000h
PWM1ERS_ERS_SIZE                         equ 0008h
PWM1ERS_ERS_LENGTH                       equ 0008h
PWM1ERS_ERS_MASK                         equ 00FFh
PWM1ERS_ERS0_POSN                        equ 0000h
PWM1ERS_ERS0_POSITION                    equ 0000h
PWM1ERS_ERS0_SIZE                        equ 0001h
PWM1ERS_ERS0_LENGTH                      equ 0001h
PWM1ERS_ERS0_MASK                        equ 0001h
PWM1ERS_ERS1_POSN                        equ 0001h
PWM1ERS_ERS1_POSITION                    equ 0001h
PWM1ERS_ERS1_SIZE                        equ 0001h
PWM1ERS_ERS1_LENGTH                      equ 0001h
PWM1ERS_ERS1_MASK                        equ 0002h
PWM1ERS_ERS2_POSN                        equ 0002h
PWM1ERS_ERS2_POSITION                    equ 0002h
PWM1ERS_ERS2_SIZE                        equ 0001h
PWM1ERS_ERS2_LENGTH                      equ 0001h
PWM1ERS_ERS2_MASK                        equ 0004h
PWM1ERS_ERS3_POSN                        equ 0003h
PWM1ERS_ERS3_POSITION                    equ 0003h
PWM1ERS_ERS3_SIZE                        equ 0001h
PWM1ERS_ERS3_LENGTH                      equ 0001h
PWM1ERS_ERS3_MASK                        equ 0008h
PWM1ERS_ERS4_POSN                        equ 0004h
PWM1ERS_ERS4_POSITION                    equ 0004h
PWM1ERS_ERS4_SIZE                        equ 0001h
PWM1ERS_ERS4_LENGTH                      equ 0001h
PWM1ERS_ERS4_MASK                        equ 0010h
PWM1ERS_ERS5_POSN                        equ 0005h
PWM1ERS_ERS5_POSITION                    equ 0005h
PWM1ERS_ERS5_SIZE                        equ 0001h
PWM1ERS_ERS5_LENGTH                      equ 0001h
PWM1ERS_ERS5_MASK                        equ 0020h
PWM1ERS_ERS6_POSN                        equ 0006h
PWM1ERS_ERS6_POSITION                    equ 0006h
PWM1ERS_ERS6_SIZE                        equ 0001h
PWM1ERS_ERS6_LENGTH                      equ 0001h
PWM1ERS_ERS6_MASK                        equ 0040h
PWM1ERS_ERS7_POSN                        equ 0007h
PWM1ERS_ERS7_POSITION                    equ 0007h
PWM1ERS_ERS7_SIZE                        equ 0001h
PWM1ERS_ERS7_LENGTH                      equ 0001h
PWM1ERS_ERS7_MASK                        equ 0080h

// Register: PWM1CLK
#define PWM1CLK PWM1CLK
PWM1CLK                                  equ 0461h
// bitfield definitions
PWM1CLK_CLK_POSN                         equ 0000h
PWM1CLK_CLK_POSITION                     equ 0000h
PWM1CLK_CLK_SIZE                         equ 0008h
PWM1CLK_CLK_LENGTH                       equ 0008h
PWM1CLK_CLK_MASK                         equ 00FFh
PWM1CLK_CLK0_POSN                        equ 0000h
PWM1CLK_CLK0_POSITION                    equ 0000h
PWM1CLK_CLK0_SIZE                        equ 0001h
PWM1CLK_CLK0_LENGTH                      equ 0001h
PWM1CLK_CLK0_MASK                        equ 0001h
PWM1CLK_CLK1_POSN                        equ 0001h
PWM1CLK_CLK1_POSITION                    equ 0001h
PWM1CLK_CLK1_SIZE                        equ 0001h
PWM1CLK_CLK1_LENGTH                      equ 0001h
PWM1CLK_CLK1_MASK                        equ 0002h
PWM1CLK_CLK2_POSN                        equ 0002h
PWM1CLK_CLK2_POSITION                    equ 0002h
PWM1CLK_CLK2_SIZE                        equ 0001h
PWM1CLK_CLK2_LENGTH                      equ 0001h
PWM1CLK_CLK2_MASK                        equ 0004h
PWM1CLK_CLK3_POSN                        equ 0003h
PWM1CLK_CLK3_POSITION                    equ 0003h
PWM1CLK_CLK3_SIZE                        equ 0001h
PWM1CLK_CLK3_LENGTH                      equ 0001h
PWM1CLK_CLK3_MASK                        equ 0008h
PWM1CLK_CLK4_POSN                        equ 0004h
PWM1CLK_CLK4_POSITION                    equ 0004h
PWM1CLK_CLK4_SIZE                        equ 0001h
PWM1CLK_CLK4_LENGTH                      equ 0001h
PWM1CLK_CLK4_MASK                        equ 0010h
PWM1CLK_CLK5_POSN                        equ 0005h
PWM1CLK_CLK5_POSITION                    equ 0005h
PWM1CLK_CLK5_SIZE                        equ 0001h
PWM1CLK_CLK5_LENGTH                      equ 0001h
PWM1CLK_CLK5_MASK                        equ 0020h
PWM1CLK_CLK6_POSN                        equ 0006h
PWM1CLK_CLK6_POSITION                    equ 0006h
PWM1CLK_CLK6_SIZE                        equ 0001h
PWM1CLK_CLK6_LENGTH                      equ 0001h
PWM1CLK_CLK6_MASK                        equ 0040h
PWM1CLK_CLK7_POSN                        equ 0007h
PWM1CLK_CLK7_POSITION                    equ 0007h
PWM1CLK_CLK7_SIZE                        equ 0001h
PWM1CLK_CLK7_LENGTH                      equ 0001h
PWM1CLK_CLK7_MASK                        equ 0080h

// Register: PWM1LDS
#define PWM1LDS PWM1LDS
PWM1LDS                                  equ 0462h
// bitfield definitions
PWM1LDS_LDS_POSN                         equ 0000h
PWM1LDS_LDS_POSITION                     equ 0000h
PWM1LDS_LDS_SIZE                         equ 0008h
PWM1LDS_LDS_LENGTH                       equ 0008h
PWM1LDS_LDS_MASK                         equ 00FFh
PWM1LDS_LDS0_POSN                        equ 0000h
PWM1LDS_LDS0_POSITION                    equ 0000h
PWM1LDS_LDS0_SIZE                        equ 0001h
PWM1LDS_LDS0_LENGTH                      equ 0001h
PWM1LDS_LDS0_MASK                        equ 0001h
PWM1LDS_LDS1_POSN                        equ 0001h
PWM1LDS_LDS1_POSITION                    equ 0001h
PWM1LDS_LDS1_SIZE                        equ 0001h
PWM1LDS_LDS1_LENGTH                      equ 0001h
PWM1LDS_LDS1_MASK                        equ 0002h
PWM1LDS_LDS2_POSN                        equ 0002h
PWM1LDS_LDS2_POSITION                    equ 0002h
PWM1LDS_LDS2_SIZE                        equ 0001h
PWM1LDS_LDS2_LENGTH                      equ 0001h
PWM1LDS_LDS2_MASK                        equ 0004h
PWM1LDS_LDS3_POSN                        equ 0003h
PWM1LDS_LDS3_POSITION                    equ 0003h
PWM1LDS_LDS3_SIZE                        equ 0001h
PWM1LDS_LDS3_LENGTH                      equ 0001h
PWM1LDS_LDS3_MASK                        equ 0008h
PWM1LDS_LDS4_POSN                        equ 0004h
PWM1LDS_LDS4_POSITION                    equ 0004h
PWM1LDS_LDS4_SIZE                        equ 0001h
PWM1LDS_LDS4_LENGTH                      equ 0001h
PWM1LDS_LDS4_MASK                        equ 0010h
PWM1LDS_LDS5_POSN                        equ 0005h
PWM1LDS_LDS5_POSITION                    equ 0005h
PWM1LDS_LDS5_SIZE                        equ 0001h
PWM1LDS_LDS5_LENGTH                      equ 0001h
PWM1LDS_LDS5_MASK                        equ 0020h
PWM1LDS_LDS6_POSN                        equ 0006h
PWM1LDS_LDS6_POSITION                    equ 0006h
PWM1LDS_LDS6_SIZE                        equ 0001h
PWM1LDS_LDS6_LENGTH                      equ 0001h
PWM1LDS_LDS6_MASK                        equ 0040h
PWM1LDS_LDS7_POSN                        equ 0007h
PWM1LDS_LDS7_POSITION                    equ 0007h
PWM1LDS_LDS7_SIZE                        equ 0001h
PWM1LDS_LDS7_LENGTH                      equ 0001h
PWM1LDS_LDS7_MASK                        equ 0080h

// Register: PWM1PR
#define PWM1PR PWM1PR
PWM1PR                                   equ 0463h

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
PWM1PRL                                  equ 0463h
// bitfield definitions
PWM1PRL_PRL_POSN                         equ 0000h
PWM1PRL_PRL_POSITION                     equ 0000h
PWM1PRL_PRL_SIZE                         equ 0008h
PWM1PRL_PRL_LENGTH                       equ 0008h
PWM1PRL_PRL_MASK                         equ 00FFh

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
PWM1PRH                                  equ 0464h
// bitfield definitions
PWM1PRH_PRH_POSN                         equ 0000h
PWM1PRH_PRH_POSITION                     equ 0000h
PWM1PRH_PRH_SIZE                         equ 0008h
PWM1PRH_PRH_LENGTH                       equ 0008h
PWM1PRH_PRH_MASK                         equ 00FFh

// Register: PWM1CPRE
#define PWM1CPRE PWM1CPRE
PWM1CPRE                                 equ 0465h
// bitfield definitions
PWM1CPRE_CPRE_POSN                       equ 0000h
PWM1CPRE_CPRE_POSITION                   equ 0000h
PWM1CPRE_CPRE_SIZE                       equ 0008h
PWM1CPRE_CPRE_LENGTH                     equ 0008h
PWM1CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM1PIPOS
#define PWM1PIPOS PWM1PIPOS
PWM1PIPOS                                equ 0466h
// bitfield definitions
PWM1PIPOS_PIPOS_POSN                     equ 0000h
PWM1PIPOS_PIPOS_POSITION                 equ 0000h
PWM1PIPOS_PIPOS_SIZE                     equ 0008h
PWM1PIPOS_PIPOS_LENGTH                   equ 0008h
PWM1PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM1GIR
#define PWM1GIR PWM1GIR
PWM1GIR                                  equ 0467h
// bitfield definitions
PWM1GIR_S1P1IF_POSN                      equ 0000h
PWM1GIR_S1P1IF_POSITION                  equ 0000h
PWM1GIR_S1P1IF_SIZE                      equ 0001h
PWM1GIR_S1P1IF_LENGTH                    equ 0001h
PWM1GIR_S1P1IF_MASK                      equ 0001h
PWM1GIR_S1P2IF_POSN                      equ 0001h
PWM1GIR_S1P2IF_POSITION                  equ 0001h
PWM1GIR_S1P2IF_SIZE                      equ 0001h
PWM1GIR_S1P2IF_LENGTH                    equ 0001h
PWM1GIR_S1P2IF_MASK                      equ 0002h

